{"count":1,"next":null,"previous":null,"results":[{"id":"NB7LX75","url":"https://www.italictype.com/api/bookqueueitems/NB7LX75/","book":{"id":"8G6Zbgv","url":"https://www.italictype.com/api/books/8G6Zbgv/","share_identifier":"i4ej5LEfMS","slug":"blank-space-1","source_name":"GoogleBooksV1","source_uid":"ptBHEQAAQBAJ","source_etag":"bDvtpxJALis","title":"Blank Space","subtitle":"A Cultural History of the Twenty-First Century","authors":["W. David Marx"],"publisher":"Penguin","published_date":"2025-11-18","description":"<b>A <i>New York Times Book Review</i> Editors’ Choice · A <i>Washington Post </i>Notable Nonfiction Book of 2025 · A <i>People </i>Best Book of November 2025 · An NPR Most Anticipated Book of Fall 2025<br> <br>A revealing exploration of a quarter century of cultural stagnation, examining the commercial and technological forces that have come to dominate contemporary culture—from music and fashion to art, film, TV, and beyond</b><br><br>Over the past twenty-five years, pop culture has suffered from a perplexing lack of reinvention. We’ve entered a cultural “blank space”—an era when reboots, rehashes, and fads flourish, while bold artistic experimentation struggles to gain recognition. Why is risk no longer rewarded, and how did playing it safe become the formula for success? Acclaimed cultural historian W. David Marx sets out to uncover the answers.<br><br>In this ambitious cultural history, Marx guides us through the blur of the twenty-first century so far, from the Obama era to the rise of K-pop, from Paris Hilton to the Marvel cinematic universe, from Beyoncé and Taylor Swift to . . . Beyoncé and Taylor Swift, whose enduring influence highlights both their adaptability and the broader shifts in pop culture. Combining sociological, economic, and political insights with a deep dive into art, street culture, fashion, and technology, <i>Blank Space </i>dissects the rise of profit-driven, formulaic trends and the shifting cultural norms that often prioritize going viral over innovation. He reveals how backlash against indie snobbery and nineties counterculture gave rise to a “counter-counterculture”—one marked by antiliberal sentiment, the celebration of business heroes, and the increasing influence of industry plants and the elite class. In a world of crypto bros, nepo babies, and AI-driven art, Marx offers readers a much-needed dose of clarity and context.<br><br>Vibrantly narrated and sharply argued, <i>Blank Space </i>is an essential guide for anyone looking to understand the chaos of the twenty-first century, the trends, tastemakers, and icons who shaped it, and how we might push our culture forward over the next quarter century—through renewed emphasis on creativity, community, and the values that transcend mere profit.","isbn_10":"0593834003","isbn_13":"9780593834008","asin":"","page_count":387,"binding":"N/A","cover_image_url":"https://books.google.com/books/publisher/content?id=ptBHEQAAQBAJ&printsec=frontcover&img=1&zoom=1&imgtk=AFLRE71gRMufyOYoZi1RiTBY6k-WOA28rX-XqsVcynuZ4jVx3Y4fEjylZIsdAbFFssD4NJuycp0cLuWmjWWr87VOAtrAidRBZ350HchX9S5zHCOSSNT-86eNGWZyxj18u5C0jFEl_PR9&source=gbs_api","language":"en","is_verified":true,"created_at":"2026-01-20T12:24:14.715512Z","updated_at":"2026-01-20T12:24:15.442100Z","add_book_url":"https://app.italictype.com/actions/book/i4ej5LEfMS/","book_detail_url":"https://app.italictype.com/books/1/ptBHEQAAQBAJ/blank-space-1"},"book_queue":"38G2WvQ","display_state":1,"display_state_queue_name":"Currently reading","display_position":0,"label":"","current_page_number":0,"adjusted_page_count":null,"is_removed":false,"number_of_times_read":0,"track_by_percentage":false,"date_finished":null,"started_reading_at":"2026-01-20T12:24:18.215445Z","finished_reading_at":null,"restarted_reading_at":null,"paused_reading_at":null,"removed_at":null,"created_at":"2026-01-20T12:24:14.734636Z","updated_at":"2026-01-20T12:24:18.220848Z","user_review":null,"page_count":387,"percent_complete":0}]}